#1-й вариант
# x = int(input())
# if x % 4 != 0:
#     print("Обычный")
# elif x % 100 == 0:
#     if x % 400 == 0:
#         print("Високостный")
#     else:
#         print("Обычный")
# else:
#     print("Високостный")
#
#2-й вариант
# x = int(input())
# if x % 4 != 0 or (x % 100 == 0 and x % 400 != 0):
#     print("Обычный")
# else:
#     print("Високостный")


#--------------------------------------------------------------#

# a = int(input("a = "))
# b = int(input("b = "))
# c = int(input("c = "))

# if a + b <= c or a + c <= b or b + c <= a:
#     print("Треугольник не существует")
# elif a != b and a != c and b != c:
#     print("Разносторонний")
# elif a == b == c:
#     print("Равносторонний")
# else:
#     print("Равнобедренный")

#-----------------------------------------------------------------#