#-------------Hw-3-#9----------------------------#
#Задать пользователю 3 вопроса, в каждом вопросе по 3 варианта ответа. 
#За каждый правильный ответ начисляется 2 балла. 
#После вопросов выведите пользователю количество набранных баллов.

res = 0
answer1 = input("Какая кнопка справа от кнопки «N»:\n")
if (answer1 =='M' or 'm'):
    answer11 = input("Какая кнопка слева от кнопки «U»:\n")
    if (answer11 == 'Y' or 'y'):
        res+=2
    answer12 = input("Какая кнопка слева от кнопки «P»:\n")
    if (answer12 == 'O' or 'o'):
        res+=2
    answer13 = input("Какая кнопка слева от кнопки «V»:\n")
    if (answer13 == 'C' or 'c'):
        res+=2
    res+=2
answer2 = input("Какая кнопка слева от кнопки «К»:\n")
if (answer2 =='J' or 'j'):
    answer21 = input("Какая кнопка справа от кнопки «F»:\n")
    if (answer21 == 'G' or 'g'):
        res+=2
    answer22 = input("Какая кнопка справа от кнопки «A»:\n")
    if (answer22 == 'S' or 's'):
        res+=2
    answer23 = input("Какая кнопка справа от кнопки «Z»:\n")
    if (answer23 == 'X' or 'x'):
        res+=2
    res+=2
answer3 = input("Какая кнопка внизу от кнопки «W»:\n")
if (answer3 == 'S' or 's'):
    answer31 = input("Какая кнопка внизу от кнопки «F»:\n")
    if (answer31 == 'V' or 'v'):
        res+=2
    answer32 = input("Какая кнопка внизу от кнопки «Y»:\n")
    if (answer32 == 'H' or 'h'):
        res+=2
    answer33 = input("Какая кнопка внизу от кнопки «O»:\n")
    if (answer33 == 'L' or 'l'):
        res+=2
    res+=2
print(f'Ваш счёт: ${res}')