vvod = +prompt("Введите число от 1 до 9:\n")
if (vvod == 1) {
    console.log('Цифре', vvod, 'соответствует спецзнак - !')
} else if (vvod == 2) {
    console.log('Цифре', vvod, 'соответствует спецзнак - @')
} else if (vvod == 3) {
    console.log('Цифре', vvod, 'соответствует спецзнак - #')
} else if (vvod == 4) {
    console.log('Цифре', vvod, 'соответствует спецзнак - %')
}  else if (vvod == 5) {
    console.log('Цифре', vvod, 'соответствует спецзнак - $')
}  else if (vvod == 6) {
    console.log('Цифре', vvod, 'соответствует спецзнак - ^')
} else if (vvod == 7) {
    console.log('Цифре', vvod, 'соответствует спецзнак - &')
} else if (vvod == 8) {
    console.log('Цифре', vvod, 'соответствует спецзнак - *')
} else if (vvod == 9) {
    console.log('Цифре', vvod, 'соответствует спецзнак - (')
} else if (vvod == 0) {
    console.log('Цифре', vvod, 'соответствует спецзнак - )')
} else {
    console.log("Введено неправильное число")
}


////////////////////////////////////////////////////////////////////////////////////////////////////////
// let nmb = Math.abs(
//     Math.trunc(+prompt("Нажмите на клавиатуре клавишу с цифрой от 0 до 9: "))
//   );
//   switch (nmb) {
//     case 0:
//       alert('На данной клавише верхний спецсимвол ")"');
//       break;
//     case 1:
//       alert('На данной клавише верхний спецсимвол "!"');
//       break;
//     case 2:
//       alert('На данной клавише верхний спецсимвол "@"');
//       break;
//     case 3:
//       alert('На данной клавише верхний спецсимвол "#"');
//       break;
//     case 4:
//       alert('На данной клавише верхний спецсимвол "$"');
//       break;
//     case 5:
//       alert('На данной клавише верхний спецсимвол "%"');
//       break;
//     case 6:
//       alert('На данной клавише верхний спецсимвол "^"');
//       break;
//     case 7:
//       alert('На данной клавише верхний спецсимвол "&"');
//       break;
//     case 8:
//       alert('На данной клавише верхний спецсимвол "*"');
//       break;
//     case 9:
//       alert('На данной клавише верхний спецсимвол "("');
//       break;
//     default:
//       alert("Вы не ввели число от 0 до 9!");
//       break;
//   }
  